# Operasjoner

Det er mange operasjoner med pandas som vil være veldig nyttige for deg, men faller ikke inn i noen distinkt kategori. La oss vise dem her i denne notatboken:

In [1]:
import pandas as pd

c:\users\magnus\appdata\local\programs\python\python36\lib\site-packages\numpy\_distributor_init.py:32: UserWarning: loaded more than 1 DLL from .libs:
c:\users\magnus\appdata\local\programs\python\python36\lib\site-packages\numpy\.libs\libopenblas.TXA6YQSD3GCQQC22GEQ54J2UDCXDXHWN.gfortran-win_amd64.dll
c:\users\magnus\appdata\local\programs\python\python36\lib\site-packages\numpy\.libs\libopenblas.WCDJNK7YVMPZQ2ME2ZZHJJRJ3JIKNDB7.gfortran-win_amd64.dll
  stacklevel=1)

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

### Info om unike verdier

array([444, 555, 666], dtype=int64)

3

444    2
555    1
666    1
Name: col2, dtype: int64

### Velge data

   col1  col2 col3
3     4   444  xyz

### Bruke funksjoner

In [8]:
def times2(x):
    return x * 2

0    2
1    4
2    6
3    8
Name: col1, dtype: int64

0    3
1    3
2    3
3    3
Name: col3, dtype: int64

10

**Fjerne en kolonne permanent**

   col2 col3
0   444  abc
1   555  def
2   666  ghi
3   444  xyz

**Få kolonne- og indeksnavn:**

Index(['col2', 'col3'], dtype='object')

RangeIndex(start=0, stop=4, step=1)

**Sortere og bestille en DataFrame:**

   col2 col3
0   444  abc
1   555  def
2   666  ghi
3   444  xyz

   col2 col3
0   444  abc
3   444  xyz
1   555  def
2   666  ghi

**Finn nullverdier eller se etter nullverdier**

    col2   col3
0  False  False
1  False  False
2  False  False
3  False  False

   col2 col3
0   444  abc
1   555  def
2   666  ghi
3   444  xyz

**Fyll ut NaN-verdier med noe annet:**

In [20]:
import numpy as np

   col1   col2 col3
0   1.0    NaN  abc
1   2.0  555.0  def
2   3.0  666.0  ghi
3   NaN  444.0  xyz

   col1  col2 col3
0     1  FILL  abc
1     2   555  def
2     3   666  ghi
3  FILL   444  xyz

     A    B  C  D
0  foo  one  x  1
1  foo  one  y  3
2  foo  two  x  2
3  bar  two  y  5
4  bar  one  x  4
5  bar  one  y  1

C          x    y
A   B
bar one  4.0  1.0
    two  NaN  5.0
foo one  1.0  3.0
    two  2.0  NaN